//
// Created by amiba on 2023/4/2.
//

#include "Gui.h"

void mainMenu(){
    system("cls");
    printf("**********************************************\n");
    printf("*             欢迎使用图书管理系统           *\n");
    printf("**********************************************\n");
    printf("\n");
    printf("***********中文测试啊啊啊啊啊啊啊啊啊啊***********\n");
    printf("*                                                                *\n");
    printf("*                ---------------------------------               *\n");
    printf("*                |   Powered By c.biancheng.net  |               *\n");
    printf("*                ---------------------------------               *\n");
    printf("*                                                                *\n");
    printf("*                1)添加学生信息                                  *\n");
    printf("*                2)删除学生信息(根据学号)                        *\n");
    printf("*                3)修改学生信息(根据学号)                        *\n");
    printf("*                4)查询学生信息                                  *\n");
    printf("*                5)显示所有学生信息以及统计信息                  *\n");
    printf("*                0)退出软件                                      *\n");
    printf("*                                                                *\n");
    printf("******************************************************************\n");
    getchar();
}